단순 질의 )
1-1) 모든 극장의 이름과 위치를 보이시오.
SELECT 극장이름, 위치
FROM 극장;

1-2) '잠실'에 있는 극장을 보이시오.
SELECT 극장이름
FROM 극장
WHERE 위치='잠실';

1-3) '잠실'에 사는 고객의 이름을 오름차순으로 보이시오.
SELECT 이름
FROM 고객
WHERE 주소='잠실'
ORDER BY 이름;

1-4) 가격이 8,000원 이하인 영화의 극장번호, 상영관번호, 영화제목을 보이시오.
SELECT 극장번호, 상영관번호, 영화제목
FROM 상영관
WHERE 가격 <=8000;

1-5) 극장 위치와 고객의 주소가 같은 고객을 보이시오
SELECT DISTINCT 극장. 위치 AS 극장위치, 고객 .주소 AS 고객주소, 이름
FROM 극장, 고객
WHERE 극장.위치 = 고객.주소;

2) 집계 질의
2-1) 극장의 수는 몇 개인가?
SELECT COUNT(*)
FROM 극장;

2-2) 상영되는 영화의 평균 가격은 얼마인가?
SELECT ROUND(AVG(가격))
FROM 상영관;

2-3) 2020년 9월 1일에 영화를 관람한 고객의 수는 얼마인가?
SELECT COUNT(고객번호)
FROM 예약
WHERE 날짜='2020-09-01';


(3)부속질의와 조건

3-1) '대한'극장에서 상영된 영화제목을 보이시오.
SELECT 상영관. 영화제목
FROM 극장, 상영관
WHERE 극장. 극장번호 = 상영관. 극장번호 AND 극장이름 = '대한';

3-2) '대한' 극장에서 영화를 본 고객의 이름을 보이시오.
SELECT 고객. 이름
FROM 극장, 예약, 고객
WHERE 극장. 극장번호 = 예약. 극장번호 AND 고객. 고객번호 = 예약. 고객번호 AND 극장. 극장이름 = '대한';


3-3) '대한' 극장의 전체 수입을 보이시오.
SELECT SUM(가격)
FROM 극장, 상영관
WHERE 극장. 극장번호 = 상영관. 극장번호 AND 극장이름 = '대한';

 
(4) 그룹질의 

4-1) 극장별 상영관 수를 보이시오.
SELECT 극장. 극장이름, COUNT(상영관번호)
FROM 극장, 상영관
WHERE 극장. 극장번호 = 상영관. 극장번호
GROUP BY 극장이름;



4-2) '잠실'에 있는 극장의 상영관을 보이시오.
SELECT DISTINCT 극장이름, 상영관번호
FROM 극장, 상영관
WHERE 극장 .극장번호 = 상영관 .극장번호 AND 위치 = '잠실';

4-3) 2020년 9월 1일의 극장별 평균 관람 고객 수를 보이시오.
SELECT 극장 .극장이름, COUNT(*)
FROM 극장, 예약
WHERE 극장 .극장번호 = 예약. 극장번호 AND 날짜='2020-09-01'
GROUP BY 예약 .극장번호, 극장 .극장이름;

4-4) 2020년 9월 1일에 가장 많은 고객이 관람한 영화를 보이시오.
SELECT MAX(COUNT(고객번호))
FROM 상영관, 예약
WHERE 상영관. 극장번호 = 예약. 극장번호 AND 상영관 .상영관번호 = 예약 .상영관번호
AND 날짜='2020-09-01'
GROUP BY 영화제목;
